; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v2)
             (pred_12 ?v6 ?v12)
             (pred_6 ?v5 ?v12)
             (pred_8 ?v4 ?v5 )
	     (pred_9 ?v5)
             (pred_2 ?v11)
             (pred_3 ?v6)
             (pred_5 ?v12)
             (pred_4 ?v5)
             (pred_10 ?v6)
             (pred_1 ?v5)
             (pred_7 ))



(:action op_3
:parameters (?v9 ?v13 ?v8 ?v10)
:precondition (and (pred_2 ?v9) (pred_2 ?v13) (pred_3 ?v8) (pred_5 ?v10)
          (pred_11 ?v9 ?v13) (pred_12 ?v8 ?v10)
                   (pred_6 ?v13 ?v10) (pred_9 ?v9) 
                   (pred_4 ?v13) (pred_10 ?v8))
:effect (and  (pred_1 ?v13) (not (pred_4 ?v13))))


(:action op_1
:parameters (?v9 ?v7)
:precondition (and (pred_2 ?v9) (pred_2 ?v7)
               (pred_9 ?v9) (pred_11 ?v9 ?v7) (pred_1 ?v7))
:effect (and (pred_9 ?v7) (not (pred_9 ?v9))))

(:action op_4
:parameters (?v9 ?v8)
:precondition (and (pred_2 ?v9) (pred_3 ?v8) 
                  (pred_9 ?v9) (pred_8 ?v8 ?v9) (pred_7 ))
:effect (and (pred_10 ?v8)
   (not (pred_8 ?v8 ?v9)) (not (pred_7 ))))


(:action op_2
:parameters (?v9 ?v3 ?v1)
:precondition (and (pred_2 ?v9) (pred_3 ?v3) (pred_3 ?v1)
                  (pred_9 ?v9) (pred_10 ?v1) (pred_8 ?v3 ?v9))
:effect (and (pred_10 ?v3) (pred_8 ?v1 ?v9)
        (not (pred_10 ?v1)) (not (pred_8 ?v3 ?v9))))

(:action op_5
:parameters (?v9 ?v8)
:precondition (and (pred_2 ?v9) (pred_3 ?v8) 
                  (pred_9 ?v9) (pred_10 ?v8))
:effect (and (pred_7 ) (pred_8 ?v8 ?v9) (not (pred_10 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_14 obj_15 obj_01 obj_06 obj_08 obj_18 obj_17 obj_12 obj_30 obj_28 obj_07 obj_05 obj_23 obj_31 obj_22 obj_21 obj_20 obj_03 obj_19 obj_29 obj_27 obj_09 obj_25 obj_11
    obj_02 obj_10 obj_04
    obj_16 obj_24 obj_13
    )

    (:init
       (pred_7)

       (pred_2 obj_26)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_01)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_30)
       (pred_2 obj_28)
       (pred_2 obj_07)
       (pred_2 obj_05)
       (pred_2 obj_23)
       (pred_2 obj_31)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_19)
       (pred_2 obj_29)
       (pred_2 obj_27)
       (pred_2 obj_09)
       (pred_2 obj_25)
       (pred_2 obj_11)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_24)
       (pred_3 obj_13)

       (pred_11 obj_26 obj_08)
       (pred_11 obj_26 obj_14)
       (pred_11 obj_14 obj_18)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_26)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_15 obj_01)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_30 obj_31)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_30 obj_12)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_28 obj_07)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_07 obj_21)
       (pred_11 obj_07 obj_05)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_28)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_23)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_05 obj_07)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_31)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_23 obj_05)
       (pred_11 obj_31 obj_19)
       (pred_11 obj_31 obj_30)
       (pred_11 obj_31 obj_23)
       (pred_11 obj_22 obj_29)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_22 obj_28)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_20)
       (pred_11 obj_21 obj_07)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_21)
       (pred_11 obj_03 obj_25)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_19 obj_31)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_29 obj_27)
       (pred_11 obj_29 obj_22)
       (pred_11 obj_27 obj_09)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_29)
       (pred_11 obj_09 obj_25)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_27)
       (pred_11 obj_25 obj_11)
       (pred_11 obj_25 obj_03)
       (pred_11 obj_25 obj_09)
       (pred_11 obj_11 obj_19)
       (pred_11 obj_11 obj_25)
       (pred_4 obj_20)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_6  obj_20 obj_02)
       (pred_6  obj_14 obj_10)
       (pred_6  obj_07 obj_04)
       (pred_1 obj_26)
       (pred_1 obj_15)
       (pred_1 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_30)
       (pred_1 obj_28)
       (pred_1 obj_05)
       (pred_1 obj_23)
       (pred_1 obj_31)
       (pred_1 obj_22)
       (pred_1 obj_21)
       (pred_1 obj_03)
       (pred_1 obj_19)
       (pred_1 obj_29)
       (pred_1 obj_27)
       (pred_1 obj_09)
       (pred_1 obj_25)
       (pred_1 obj_11)

       (pred_12  obj_16 obj_02)
       (pred_12  obj_24 obj_10)
       (pred_12  obj_13 obj_04)
       (pred_8 obj_16 obj_30)
       (pred_8 obj_24 obj_15)
       (pred_8 obj_13 obj_06)
       (pred_9 obj_26)
    )

    (:goal (and
       (pred_8 obj_16 obj_28)
       (pred_8 obj_24 obj_31)
    ))
(:constraints
  (always (not (pred_9 obj_12)))
)
)

; plan
1. (op_1 obj_26 obj_08)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_08)
   goals met: 0 of 2
2. (op_1 obj_08 obj_18)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_18)
   goals met: 0 of 2
3. (op_1 obj_18 obj_17)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_17)
   goals met: 0 of 2
4. (op_1 obj_17 obj_15)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_15)
   goals met: 0 of 2
5. (op_4 obj_15 obj_24)
   deleted: (pred_8 obj_24 obj_15) (pred_7)
   added: (pred_10 obj_24)
   goals met: 0 of 2
6. (op_1 obj_15 obj_01)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_01)
   goals met: 0 of 2
7. (op_1 obj_01 obj_06)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_06)
   goals met: 0 of 2
8. (op_1 obj_06 obj_30)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_30)
   goals met: 0 of 2
9. (op_1 obj_30 obj_31)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_31)
   goals met: 0 of 2
10. (op_5 obj_31 obj_24)
   deleted: (pred_10 obj_24)
   added: (pred_7) (pred_8 obj_24 obj_31)
   goals met: 1 of 2
11. (op_1 obj_31 obj_30)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_30)
   goals met: 1 of 2
12. (op_4 obj_30 obj_16)
   deleted: (pred_8 obj_16 obj_30) (pred_7)
   added: (pred_10 obj_16)
   goals met: 1 of 2
13. (op_1 obj_30 obj_06)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_06)
   goals met: 1 of 2
14. (op_1 obj_06 obj_01)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_01)
   goals met: 1 of 2
15. (op_1 obj_01 obj_15)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_15)
   goals met: 1 of 2
16. (op_1 obj_15 obj_17)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_17)
   goals met: 1 of 2
17. (op_1 obj_17 obj_18)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_18)
   goals met: 1 of 2
18. (op_1 obj_18 obj_08)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_08)
   goals met: 1 of 2
19. (op_1 obj_08 obj_28)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_28)
   goals met: 1 of 2
20. (op_5 obj_28 obj_16)
   deleted: (pred_10 obj_16)
   added: (pred_7) (pred_8 obj_16 obj_28)
   goals met: 2 of 2
